# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/science'


# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
brew 'tree'
brew 'node'
brew 'wget'

# Development
brew 'php71', args: ['with-debug']
brew 'php71-intl'
brew 'mariadb'
brew 'hdf5'
brew 'cmake'
brew 'mariadb'
brew 'python3'
brew 'mariadb'
brew 'qt'
brew 'doxygen'
brew 'ffmpeg'
brew 'sfml'
brew 'mariadb'
brew 'graphviz'
brew 'mariadb'
brew 'go'
brew 'maven'
brew 'valgrind'
brew 'clock'
brew '--with-clang llvm'
brew 'r'

# Apps
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'phpstorm'
cask 'clion'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'transmit'
cask 'vlc'
cask 'blender'
cask 'eclipse-cpp'
cask 'flux'
cask 'github'
cask 'handbrake'
cask 'insomnia'
cask 'logisim'
cask 'macdown'
cask 'vlc'
cask 'spotify'
cask 'opera'
cask 'skype'
cask 'subler'
cask 'texmaker'
cask 'wireshark'
cask 'burn'
cask 'the-unarchiver'
cask 'xquartz'
cask 'atom'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
